---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDiscardedSplittersWarning
source: html/f0c492b3-a59f-e768-a3eb-23fd0bd55a40.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DividedSurfaceFailures.DividedSurfaceDiscardedSplittersWarning Property

Not all intersecting references (levels, reference planes or lines) could be used to intersect the surface

## Syntax (C#)
```csharp
public static FailureDefinitionId DividedSurfaceDiscardedSplittersWarning { get; }
```